SURV/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Домен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Офис</name>
    <type>
      <types>CatalogRef.Офисы</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.Отделы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонДобавочный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Родитель1</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель2</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель3</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель4</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель5</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель6</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель7</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель8</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

SURV/src/InformationRegisters/УчетРабочегоВремени/УчетРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетРабочегоВремени</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВидВремени</name>
    <type>
      <types>EnumRef.ВидыВремени</types>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Офис</name>
    <type>
      <types>CatalogRef.Офисы</types>
    </type>
  </resources>
  <resources>
    <name>ПользовательПодписант</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>Дверь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SURV/src/Catalogs/Пользователи/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтоПолныеПрава = РольДоступна("ПолныеПрава");
	Элементы.Домен.Доступность = ЭтоПолныеПрава;
	Элементы.Домен.ТолькоПросмотр = Не ЭтоПолныеПрава;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Элементы.Родитель.Доступность = Сервер.ЕстьПрава("ПолныеПрава") Или Сервер.ЕстьПрава("Кадровик");
	УстановитьНадписьПользователяИБ();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИсторию(Команда)
	ОткрытьФорму("РегистрСведений.УчетРабочегоВремени.Форма.ФормаИсторияЗаПериод",Новый Структура("ОтборПоПользователю",Объект.Ссылка));
КонецПроцедуры

&НаКлиенте
Процедура ПользовательИБНажатие(Элемент)
	Если Сервер.ЕстьПрава("ПолныеПрава") Тогда 
		УказатьПользователя();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УказатьПользователя()
	СписокПольз = ПолучитьСписокПользователейИБ(Истина);
	//ВыбЭл = СписокПольз.ВыбратьЭлемент("Выберите пользователя ИБ");
	СписокПольз.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("УказатьПользователяЗавершение",ЭтаФорма),"Выберите пользователя ИБ");
КонецПроцедуры

&НаКлиенте
Процедура УказатьПользователяЗавершение(ВыбЭл,ДопПараметры) Экспорт 
	Если ВыбЭл = Неопределено Тогда 
		Сообщить("Пользователь ИБ не выбран!");
	Иначе
		УстановитьПользователяИБ(ВыбЭл.Значение);
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокПользователейИБ(СПустым = Ложь)
    СписокПольз = Новый СписокЗначений;
	Если СПустым Тогда 
		СписокПольз.Добавить(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"),"<пустой>");
	КонецЕсли;
	МасПольз = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для Каждого ЭлМас Из МасПольз Цикл 
		СписокПольз.Добавить(ЭлМас.УникальныйИдентификатор,ЭлМас.Имя);
	КонецЦикла;
	Возврат СписокПольз;
КонецФункции

&НаСервере 
Процедура УстановитьПользователяИБ(Ид)
	ПользИБ = Сервер.НайтиПользователяИБ(Ид);
	Если ПользИБ <> Неопределено Тогда 
		Объект.ПользовательИБ = ПользИБ.УникальныйИдентификатор;
		УстановитьНадписьПользователяИБ(ПользИБ.Имя);
	КонецЕсли;
КонецПроцедуры

&НаСервере 
Процедура УстановитьНадписьПользователяИБ(Имя = "")
	Если Имя = "" Тогда 
		Ид = Объект.ПользовательИБ;
		ПользИБ = Сервер.НайтиПользователяИБ(Ид);
		Если ПользИБ <> Неопределено Тогда 
			Имя = ПользИБ.Имя;
		Иначе
			Имя = "УКАЗАТЬ";
		КонецЕсли;
	КонецЕсли;	
	Элементы.НадписьПользовательИБ.Заголовок = Имя;
КонецПроцедуры

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	Объект.Родитель1 = Объект.Родитель;
КонецПроцедуры
